I am on tf v14;

> Error: error creating RDS cluster: InvalidParameterValue: The engine mode serverless you requested is currently unavailable.

In the plan:
```  # module.databases["website"].module.aurora.aws_rds_cluster.this[0] will be created
  + resource "aws_rds_cluster" "this" {
      + apply_immediately                   = false
      + arn                                 = (known after apply)
      + availability_zones                  = (known after apply)
      + backtrack_window                    = 0
      + backup_retention_period             = 1
      + cluster_identifier                  = "zxcv"
      + cluster_identifier_prefix           = (known after apply)
      + cluster_members                     = (known after apply)
      + cluster_resource_id                 = (known after apply)
      + copy_tags_to_snapshot               = true
      + database_name                       = (known after apply)
      + db_cluster_parameter_group_name     = "zxcv"
      + db_subnet_group_name                = "zxcv"
      + deletion_protection                 = false
      + enable_http_endpoint                = false
      + endpoint                            = (known after apply)
      + engine                              = "aurora"
      + engine_mode                         = "serverless"
      + engine_version                      = "2.07.1"
      + final_snapshot_identifier           = "zxcv-0014df3f"
      + hosted_zone_id                      = (known after apply)
      + iam_database_authentication_enabled = false
      + id                                  = (known after apply)
      + kms_key_id                          = (known after apply)
      + master_password                     = (sensitive value)
      + master_username                     = "deltatremtribes"
      + port                                = 3306
      + preferred_backup_window             = "08:00-09:00"
      + preferred_maintenance_window        = "sun:10:00-sun:11:00"
      + reader_endpoint                     = (known after apply)
      + skip_final_snapshot                 = true
      + storage_encrypted                   = true
      + tags                                = {
          + "Environment" = "dev"
          + "ID"          = "mtribes"
          + "Location"    = "sydney"
          + "Module"      = "databases"
          + "Provider"    = "aws"
        }
      + vpc_security_group_ids              = [
          + "sg-zxcv",
        ]

      + scaling_configuration {
          + auto_pause               = true
          + max_capacity             = 256
          + min_capacity             = 2
          + seconds_until_auto_pause = 300
          + timeout_action           = "ForceApplyCapacityChange"
        }
    }
    ```
    
    thoughts?